//***************************************************************************
//
//  File........: bcd.h
//
//  Author(s)...: Pashgan ChipEnable.Ru
//
//  Target(s)...: для любого микроконтроллера
//
//  Compiler....: подходит для любоко компилятора 
//
//  Description.: библиотека для перевода двоичных чисел в символы и вывода их на жкд 
//
//  Revisions...: 
//
//  18.10.2009 - 1.0 - Создан                                       - Pashgan.
//
//***************************************************************************
#ifndef bcd_h
#define bcd_h

//здесь подключаем свою либу для жкд
#include "lcd_lib.h"
//здесь переопределяем функцию по выводу символа на экран
//#define LCDSendData(data) LoadDataLCD(data)

/**************************************************************************
*   Function name :   Bcd1Lcd
*   Returns :         нет       
*   Parameters :      значение числа от 0 до 9    
*   Purpose :         переводит число в символ и выводит на жкд        
****************************************************************************/
void Bcd1Lcd(unsigned char value);

/**************************************************************************
*   Function name :   Bcd2Lcd
*   Returns :         нет       
*   Parameters :      значение числа от 0 до 99   
*   Purpose :         переводит число в символ и выводит на жкд        
****************************************************************************/
void Bcd2Lcd(unsigned char value);

/**************************************************************************
*   Function name :   Bcd3Lcd
*   Returns :         нет       
*   Parameters :      значение числа от 0 до 255    
*   Purpose :         переводит число в символ и выводит на жкд        
****************************************************************************/
void Bcd3Lcd(unsigned char value);

/**************************************************************************
*   Function name :   Bcd3IntLcd
*   Returns :         нет       
*   Parameters :      значение числа от 0 до 999    
*   Purpose :         переводит число в символ и выводит на жкд        
****************************************************************************/
void Bcd3IntLcd(unsigned int value);

/**************************************************************************
*   Function name :   Bcd4IntLcd
*   Returns :         нет       
*   Parameters :      значение числа от 0 до 9999    
*   Purpose :         переводит число в символ и выводит на жкд        
****************************************************************************/
void Bcd4IntLcd(unsigned int value);

/**************************************************************************
*   Function name :   Bcd5IntLcd
*   Returns :         нет       
*   Parameters :      значение числа от 0 до 65535    
*   Purpose :         переводит число в символ и выводит на жкд        
****************************************************************************/
void Bcd5IntLcd(unsigned int value);

#endif  //bcd_h




